class ReportMainPageSetting:
    FIRST_TABLE = [
            {
                "key": "Направление",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": [
                    "01.03.02 Прикладная математика и информатика",
                    "09.03.04 Программная инженерия",
                ],
                "logs": ""
            },
            {
                "key": "Профиль",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": [
                    "Математическое обеспечение программно-информационных систем",
                    "Разработка программно-информационных систем"
                ],
                "logs": ""
            },
            {
                "key": "Факультет",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": ["КТИ"],
                "logs": ""
            },
            {
                "key": "Кафедра",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": ["МО ЭВМ"],
                "logs": ""
            },
            {
                "key": "Зав. кафедрой",
                "found_value": 0,
                "found_key": 0,
                "find": 3,
                "value": ["А.А. Лисс"],
                "logs": ""
            }
    ]
    
    SECOND_TABLE = [
            {
                "key": "Руководитель",
                "found_value": 0,
                "found_key": 0,
                "find": 3,
                "value": [r"[кд]\..+\.н\., (доцент|профессор)"],    # (Руководитель).*([кд]\..+\.н\., (доцент|профессор))[|]*([А-Я]\.[А-Я]\. [А-Я][а-я]+)
                "logs": ""
            },
            {
                "key": "Консультант",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": [r"[кд]\..+\.н\., (доцент|профессор)"],    # (Консультант).*(([кд]\..+\.н\., (доцент|профессор))|).*([А-Я]\.[А-Я]\. [А-Я][а-я]+)
                                                                    # (([кд]\..+\.н\., (доцент|профессор))|)[|]*([А-Я]\.[А-Я]\. [А-Я][а-я]+)
                "logs": ""
            }
    ]