class ReportMainPageSetting:
    FIRST_TABLE = [
            {
                "key": "Направление",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": [
                    "01.03.02 - Прикладная математика и информатика",
                    "09.03.04 - Программная Инженерия",
                    "09.03.04 - Программная инженерия",
                    "01.03.02 – Прикладная математика и информатика",
                    "09.03.04 – Программная Инженерия",
                    "09.03.04 – Программная инженерия"
                ]
            },
            {
                "key": "Программа",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": [
                    "Математическое обеспечение программно-информационных систем",
                    "Разработка программно-информационных систем"
                ]
            },
            {
                "key": "Факультет",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": ["КТИ"]
            },
            {
                "key": "Кафедра",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": ["МО ЭВМ"]
            },
            {
                "key": "Зав. кафедрой",
                "found_value": 0,
                "found_key": 0,
                "find": 3,
                "value": ["А.А. Лисс"]
            }
    ]
    
    SECOND_TABLE = [
            {
                "key": "Руководитель",
                "found_value": 0,
                "found_key": 0,
                "find": 3,
                "value": [r"[кд]\..+\.н\.", r"(доцент|профессор)"]
            },
            {
                "key": "Консультант",
                "found_value": 0,
                "found_key": 0,
                "find": 1,
                "value": [r"[кд]\..+\.н\.", r"(доцент|профессор)"]
            }
    ]