class WateryPhrase:
    SERVICE_WORDS = [
        "а", "бы", "был", "была", "были", "будет", "будешь", "буду", "вот", "всё", "вся",
        "в", "для", "до", "его", "её", "ей", "если", "же", "за", "из", "и", "как", "когда", "кого",
        "ли", "лишь", "многие", "на", "не", "ни", "о", "об", "или", "он", "она", "они", "это",
        "к", "кто", "между", "над", "ну", "от", "по", "под", "при", "через", "с", "так", "та",
        "те", "то", "ты", "уж", "чтобы", "ещё"
    ]

    INTRODUCTORY_PHRASE = [
        "например", "так сказать", "кстати", "в общем", "по сути", "вроде", "между прочим", "короче",
        "если честно", "во-первых", "во-вторых", "итак", "значит", "другими словами", "с другой стороны",
        "по-моему", "по идее", "к слову", "собственно", "в принципе", "не удивлюсь", "естественно",
        "по правде говоря", "безусловно", "пожалуй", "как правило", "почему-то", "честно говоря",
        "вдобавок", "кроме того", "вдруг", "если так", "в общем-то", "скажем так"
    ]

    ABSTRACT_WORDS = [
        "некоторый", "какой-то", "некто", "некоторые", "несколько", "некий", "такой-то"
    ]
