Repository: moevm/document_insight_system
Catalog: templater/app/templater/locale/*/LC_MESSAGES/templater.po
Languages: ru

source: Quickly generate documents from docx/odt template using data from csv/xls/xlsx file.
ru: Быстро генерируйте документы из шаблона docx / odt / xlsx / ods / pptx / odp, используя данные из файл csv / xls / xlsx.

source: Upload Template
ru: Загрузить шаблон

source: Upload Data Table
ru: Загрузить таблицу данных

source: Render
ru: Обработать

source: Download Generated Files
ru: Скачать сгенерированные файлы

source: Upload Your Template
ru: Загрузить шаблон

source: Use this template
ru: Использовать этот шаблон

source: or
ru: или

source: Preview
ru: Просмотр

source: Upload Your Data Table
ru: Загрузить таблицу данных

source: Use this data table
ru: Использовать эту таблицу данных

source: Upload Data
ru: Загрузить таблицу данных

source: Verification result
ru: Результат проверки

source: File name template
ru: Шаблон именования файлов

source: Result
ru: Результат

source: Download files:
ru: Скачать отдельные файлы:

source: or download all:
ru: или скачать все в архиве:

source: Start with another file
ru: Начать с другим файлом

source: HOW TO USE
ru: КАК ИСПОЛЬЗОВАТЬ?

source: Create a document with jinja2 placeholder
ru: Создать документ-шаблон с полями для подстановки вида {{ название_поля }} . Поддерживаемые форматы документов: docx, xlsx, pptx, odt, ods, odp.

source: Create a data table
ru: Создать таблицу данных. Каждая строка таблицы будет использована для создания отдельного документа по шаблону. Поддерживаемые форматы таблиц: xls, xlsx, csv.

source: Upload to Templater and get the filled in documents
ru: Загрузить документ-шаблон и таблицу данных в Templater и получить заполненные документы.

source: ${field} not defined in the template
ru: '${field}' не определено в шаблоне

source: ${field} not defined in the csv
ru: '${field}' не определено в таблице данных

source: Verification done without warning
ru: Проверка завершена без предупреждения
